package com.fcy.Notes;

/**
 * @descripiton:
 * @author: fcy
 * @date: 2019-02-27  23:16
 */
public class NetWork {
    public static void main(String[] args) {
        /*
        *
        * Tcp协议  可靠传输  有连接   流量控制
        * 三次握手  四次挥手
        * 七个定时器
        * 滑动窗口:通过在发送方和接收方维护一个滑动窗口,接收方接收到发送方的数据后返回自己的窗口大小告诉发送方
        * 我还能接收多少数据,发送方根据接收方的窗口大小控制发送速率
        * 拥塞避免:避免过多的数据注入到网络中,主要原因还是发送方的重传定时器不好设置,
        * 拥塞避免通过维护一个拥塞窗口控制发送方的发送数据的大小,发送方发送的数据大小等于拥塞窗口和接受窗口的最小值
        *   慢开始:最开始拥塞窗口为一个报文段的大小,每接收到一个ack则翻倍,
        *
        * 流量控制
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        *
        * */
    }

}
